<?php
//	1、创建一个变量表示员工工资，按如下规则在页面中输出该工资金额的级别：
//	(1)大于等于20000，显示“高工资”
//	(2)小于20000大于等于8000，显示“中高工资”
//	(3)小于8000，显示“普通工资”
//$salary = 30000;
//echo $salary>=20000?"高工资":($salary>=8000?"中高工资":"普通工资");
//2、体重健康指数（克莱托指数）计算公式如下：
//			体重(kg)÷身高²(m)
//		20-25正常，20以下偏瘦，25以上偏胖。
//	例如：某人是60kg，1.7m，那就是：
//	60÷1.7²=20.76，属于“正常”体重；
//	创建变量保存体重和身高，输出判定结果。
//$wight = 60;
//$tall = 1.7;
//$num = $wight / ($tall*$tall);
//echo $num>25 ? "偏胖":($num>20 ? "正常":"偏瘦");#注意不要漏写

//$status = 1;
//$rs =$status===1?"等待付款":(
//		$status===2?"备货中":(
//			$status===3?"运输中":(
//				$status===4?"派送中":(
//					$status===5?"订单完成":"其他状态")
//				)
//			)
//		);
// echo $rs;
$statu = 6;
if($statu===1){
	echo "等待付款";
}else{
	if($statu===2){
		echo "备货中";
	}else{
		if($statu===3){
			echo "运输中";
		}else{
			if($statu===4){
				echo "派送中";
			}else{
				if($statu===5){
					echo "订单完成";
				}else{
					echo "其他状态";
				}
			}
		}
	}
}
//$age = 27;
//if($age>=18 && $age<=60){
//	echo "允许入学";
//}else{
//	echo "NO";
//}
//$dname = "dingding";
//$dpwd = "123456";
//if($dname==="dingding" && $dpwd==="123456"){
//	echo "欢迎回来$dname";
//}else{
//	echo "请核对用户名和密码";
//}
//$zzmm=4;
//if($zzmm===1){
//	echo "党员";
//}else{
//	if($zzmm===2){
//		echo "团员";
//	}else{
//		if($zzmm===3){
//			echo "群众";
//		}else{
//			echo "其他";
//		}
//	}
//}
?>
